Autodesk.Revit.DB.ProjectLocation.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.String)
Create an instance of ProjectLocation in the document.
Remarks:
The created instace of ProjectLocation would have the specified name and an identity Transform.
document:
The document where the new instance of ProjectLocation would be created in.
siteLocationId:
The ElementId of the SiteLocation to which the new ProjectLocation would be created.
name:
The name of the instance of ProjectLocation to be created.
Returns:
The newly created instance of ProjectLocation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The element siteLocationId does not exist in the document
-or-
name cannot include prohibited characters.
-or-
There is already a ProjectLocation with this name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2018

Autodesk.Revit.DB.ProjectLocation.SiteLocation
The site location to which this project location refers.
Remarks: The site location object contains the longitude, latitude and time-zone
of the entire project site.

Autodesk.Revit.DB.ProjectLocation.ProjectPosition(Autodesk.Revit.DB.XYZ)
Gets or sets the coordinates of a point in the project location coordinate system.
point: The point in model coordinates.
Remarks:
When getting this property,  the North/South, East/West, and Elevation values report the coordinates of the point
similar to the Revit command "Report Shared Coordinates".  To get the values of the transformations applied by this project location,
pass XYZ.Zero.
If the project has acquired shared coordinates from a linked model, the
shared coordinate transformation will be reflected in the coordinates of the transformed point returned by this property.
When setting this property, the transformations applied to the location are modified such that the passed point becomes the
specified North/South, East/West and Elevation, and the coordinate transform will have the designated angular rotation.
This is similar to the Revit command "Specify Coordinates at Point".